In [1]:
import pandas as pd

In [2]:
dataFrame = pd.read_excel("pandas_excel_ornek.xlsx")

In [3]:
dataFrame

  Unnamed: 0  Maas   Yas Departman
0   Muhammed   100  26.0   Donanım
1       Enes   200  18.0      Arge
2     Yılmaz   250   NaN    Finans
3     Furkan   300  22.0       NaN
4       Ylmz   250  10.0   Yazılım

In [4]:
# eğer Nan olanları at dersek
doluDegerlerDataFrame = dataFrame.dropna()

In [5]:
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas Departman
0   Muhammed   100  26.0   Donanım
1       Enes   200  18.0      Arge
4       Ylmz   250  10.0   Yazılım

In [6]:
doluDegerlerDataFrame.to_excel("pandas_yeni_excel.xlsx")

In [7]:
## eğer excel içinde gelen veri virgüllü ise yani csv formatında ise
## read_csv //okumak için
## to_csv // yazmak için